//NJEDIRA JOB CLASS=A,MSGCLASS=H,REGION=2048K,NOTIFY=&SYSUID
//*
//ASM      EXEC PROC=ASMFCL,
//         MAC='SYS1.MACLIB',
//         MAC1='BREXX.MACLIB',
//         MAC2='NJE38.MACLIB',
//         SOUT=H
//ASM.SYSIN    DD DISP=SHR,DSN=BREXX.ASM(RXNJE38)
//LKED.SYSLMOD DD DISP=SHR,DSN=SYS2.LINKLIB(RXNJE38)
//LKED.SYSLIB1 DD DISP=SHR,DSN=SYS2.LINKLIB
//LKED.SYSLIB2 DD DISP=SHR,DSN=NJE38.AUTHLIB
//LKED.SYSIN DD *
  INCLUDE SYSLIB2(NJESPOOL)
/*
//
