/* REXX */
say "Hello Compress"
say "<"filter("abc","def")">"
say "<"filter("This is a string","i Tsahtrng")">"
say 3.14 ceil(3.14)
say -3.14 ceil(-3.14)
say 13.0 ceil(13.0)
say "-13.0" ceil(-13.0)
say 1333.27 ceil(1333.273253)
say -1333.27 ceil(-1333.273253)
say "------- FLOOR ---------"
say "3.0e08" floor(3.0E8)
say -3.14 floor(-3.14)
say 13.0 floor(13.0)
say "-13.0" floor(-13.0)
say 1333.27 floor(1333.273253)
say -1333.27 floor(-1333.273253)