parse arg $msgpref,$msgnlen,$msgtlen,$msgcase
if $msgpref='' then $msgpref='RX
if $msgnlen='' then $msgnlen=4
if $msgtlen='' then $msgtlen=0
if $msgcase='' then $msgcase=0
return
